In [2]:
import pandas as pd

## 예제 1-10 내부 원소 처리 기준

In [3]:
import numpy as np

In [4]:
# 1~10까지의 임의의 수를 3*3 배열에 생성한다.

In [5]:
np.random.randint(1,10,(3,3))

array([[9, 2, 3],
       [1, 2, 8],
       [1, 6, 2]])

In [6]:
df_1 = pd.DataFrame(np.random.randint(1,10,(3,3)),columns=list('ABC'))

In [7]:
df_1

   A  B  C
0  1  5  3
1  9  9  8
2  8  9  3

In [8]:
df_2 = pd.DataFrame(np.random.randint(1,10,(3,3)),columns=list('CAB'))

In [9]:
df_2

   C  A  B
0  1  2  7
1  6  2  6
2  6  4  3

In [10]:
# 현재의 프레임은 유지되면서 각종 연산함수의 값이 각각의 원소에 업데이트 한다.

In [11]:
np.log(df_2)

          C         A         B
0  0.000000  0.693147  1.945910
1  1.791759  0.693147  1.791759
2  1.791759  1.386294  1.098612

In [12]:
df_1

   A  B  C
0  1  5  3
1  9  9  8
2  8  9  3

In [13]:
df_2

   C  A  B
0  1  2  7
1  6  2  6
2  6  4  3

In [14]:
# 열을 맞추어 계산한다.

In [14]:
df_1 + df_2

    A   B   C
0   3  12   4
1  11  15  14
2  12  12   9

In [9]:
df_3 = pd.DataFrame(np.random.randint(1,10,(3,2)),columns=list('CB'))

In [10]:
df_3

   C  B
0  3  5
1  1  8
2  5  8

In [ ]:
#df_3는 A열이 없으므로 없는 값(nan)과의 연산으로 A열의 모든 값은 NaN이 된다.

In [11]:
df_1 + df_3

    A   B  C
0 NaN  11  4
1 NaN  13  2
2 NaN  17  8